lab-4/webapp/app/admin/courserecs_admin.rb

  #
   table do
    column :rec_course, header: "Recommanded Courses" do |rec|
      Course.find(rec.courseId).title.to_s
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 90], ["LIMIT", 1]]