lab-4/webapp/app/admin/courses_admin.rb

    end

    tab :section do
      table SectionsAdmin.table , collection: Section.where("\"courseId\" = '#{course.courseId}'")
---
SELECT "sections".* FROM "sections" WHERE ("courseId" = '150717')

        col(sm: 6) {label "Your existing application of this course"}
      end
      if current_user.admin
        table StudentAssistantApplicationsAdmin.table , collection: StudentAssistantApplication.where("\"courseId\" = '#{course.id}'")
---
SELECT "student_assistant_applications".* FROM "student_assistant_applications" WHERE ("courseId" = '20')