lab-4/webapp/app/admin/sections_admin.rb

SELECT COUNT(*) FROM "student_assistant_applications" WHERE ("section"='46')
---
    column :instructionMode, header: "授课方式"
    column :ta_num, header: "TA number", header: "助教需求"
    column :ta_num_remain, header: "空余助教" do |sec|
      status_tag((sec.ta_num - StudentAssistantApplication.where("\"section\"='#{sec.id}'").count).to_s,{ "0" => :danger}[(sec.ta_num - StudentAssistantApplication.where("\"section\"='#{sec.id}'").count).to_s] || :success)