lab-4/webapp/app/controllers/courses_controller.rb

  def sync
    @courses = Course.save_data_from_osu
---
INSERT INTO "courses" ("title", "shortDescription", "description", "component", "subject", "catalogNumber", "campus", "courseAttributes", "courseId") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"