lab-4/webapp/app/admin/auth/account_admin.rb


      divider

      table StudentAvaliableTimesAdmin.table , collection: StudentAvaliableTime.where("\"osu_id\" = '#{user.osu_id}'")
---
SELECT "student_avaliable_times".* FROM "student_avaliable_times" WHERE ("osu_id" = 'deleteme.1')


      divider

      table StudentQualifiedCoursesAdmin.table , collection: StudentQualifiedCourse.where("\"osu_id\" = '#{user.osu_id}'")
---
SELECT "student_qualified_courses".* FROM "student_qualified_courses" WHERE ("osu_id" = 'deleteme.1')