lab-4/webapp/app/models/course.rb

  def self.save_data_from_osu
    # process http request to json file
    # source = 'https://content.osu.edu/v2/classes/search?q=cse&campus=col&p=1&term=1222&subject=cse'

    source = 'https://content.osu.edu/v2/classes/search?q=1&campus=col&p=1'

    resp = Net::HTTP.get_response(URI.parse(source))
    result = resp.body
    result = JSON.parse(result)
    courses = result['data']['courses']
    if courses.nil?
      # below is a mirror address for osu courses
      source = 'http://3901.plizong.com/osu_course.json'
      resp = Net::HTTP.get_response(URI.parse(source))
      result = resp.body
      result = JSON.parse(result)
      courses = result['data']['courses']
    end

    # TODO: For temp use in this limited time. Will fix later
    Course.delete_all
    Section.delete_all
---
DELETE FROM "courses"
DELETE FROM "sections"

          section = Section.new
          section_info = Course.grab_section_info(j)
          section.from_json(section_info.to_json, false)
          section.save
        }
        course.save
---
INSERT INTO "sections" ("classNumber", "section", "component", "instructionMode", "career", "startDate", "endDate", "buildingDescription", "startTime", "endTime", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday", "instructors", "courseId") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
INSERT INTO "courses" ("title", "shortDescription", "description", "component", "subject", "catalogNumber", "campus", "courseAttributes", "courseId") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def self.getrec(id,n)
    # process http request to json file
    if n==nil
      n=5
    end
    Courserec.delete_all
    source = 'http://172.17.0.1:5000/api?id='+id.to_s+"&n="+n.to_s
    #Courserec.delete_by(Courserec.osu_id == id)
    resp = Net::HTTP.get_response(URI.parse(source))
    result = resp.body
    result = JSON.parse(result)
    courserec = result['courses']
    courserec.each{ |i|
      course_rec = Courserec.new
      course_rec["osu_id"] = id
      course_rec["courseId"]= i
      course_rec.save
---
DELETE FROM "courserecs"
INSERT INTO "courserecs" ("osu_id", "courseId") VALUES ($1, $2) RETURNING "id"  [["osu_id", "1"], ["courseId", "90"]]