lab-4/webapp/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."osu_id" = $1 LIMIT $2  [["osu_id", "xiangli.2"], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "display_name" = $2, "admin" = $3, "avator" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["role", "teacher"], ["display_name", "Louis Xiang Li"], ["admin", false], ["avator", "https://opic.osu.edu/xiangli.2"], ["updated_at", "2022-04-23 17:43:02.602566"], ["id", 2]]
---
  def create_profile!
    unless osu_id == "deleteme.1"
    profile = User.find_by(osu_id: osu_id)
    # To make things easier we consider those who have appointment are teachers
    # (that mean student assistant will be considered as teacher, so we will allow teacher apply for teaching assistant)
    source = 'http://directory.osu.edu/fpjson.php?name_n=' + osu_id.to_s
    resp = Net::HTTP.get_response(URI.parse(source))
    result = resp.body
    result = JSON.parse(result)
    result = result[0]
    if result != nil
      user_info = User.grab_user_info(result)
      profile.from_json(user_info.to_json, false)
      profile["avator"] = "https://opic.osu.edu/" + osu_id.to_s
      profile.save